pages/zsh.org
#+setupfile:./hugo_setup.org
#+hugo_slug: zsh
#+TITLE: Zsh

Zsh, z-shell is a more flexible and configurable shell.
It offers an enhanced scripting language,
greated configurability and pluggability over the standard
shell while still implementing both the POSIX standard and conventions
used with bash, dash and sh (as the POSIX standard is unfortunately far from complete).

* Themes
[[https://github.com/geometry-zsh/geometry][Geometry is a minimal and customizable zsh prompt theme]]
* Utilities
[[https://github.com/clvv/fasd][fasd is an all-in-one shell productivity booster]]
[[https://github.com/nvbn/thefuck][fuck]] corrects your last console command.
* Alternatives
[[https://github.com/oilshell/oil][Oil shell]] is a new Unix shell alternative that can be compiled and deployed as a native executable.
https://github.com/nushell/nushell
* Configs
https://github.com/jeremyf/dotzshrc
[[https://thomask.sdf.org/blog/2019/11/09/take-care-editing-bash-scripts.html][Be careful editing bash scripts]]
