content/posts/zsh.md
+++
title = "Zsh"
author = ["Jacob Chvatal"]
lastmod = 2020-08-01T23:27:11-07:00
slug = "zsh"
draft = false
+++

Zsh, z-shell is a more flexible and configurable shell.
It offers an enhanced scripting language,
greated configurability and pluggability over the standard
shell while still implementing both the POSIX standard and conventions
used with bash, dash and sh (as the POSIX standard is unfortunately far from complete).


## Themes {#themes}

[Geometry is a minimal and customizable zsh prompt theme](https://github.com/geometry-zsh/geometry)


## Utilities {#utilities}

[fasd is an all-in-one shell productivity booster](https://github.com/clvv/fasd)
[fuck](https://github.com/nvbn/thefuck) corrects your last console command.


## Alternatives {#alternatives}

[Oil shell](https://github.com/oilshell/oil) is a new Unix shell alternative that can be compiled and deployed as a native executable.
<https://github.com/nushell/nushell>


## Configs {#configs}

<https://github.com/jeremyf/dotzshrc>
